[
  {
    "title": "Blade",
    "poster": "posters/blade.webp",
    "date": "1998-08-21",
    "duration": 120,
    "description": "Deacon Frost, a vampire, kills the elders of the underground vampiric society in order to gain control over his kind. To cement his powers, he needs the blood of Blade, a half-human vampire hunter."
  },
  {
    "title": "X-Men",
    "poster": "posters/x-men.webp",
    "date": "2000-07-14",
    "duration": 104,
    "description": "In a world where mutants (evolved super-powered humans) exist and are discriminated against, two groups form for an inevitable clash: the supremacist Brotherhood, and the pacifist X-Men."
  },
  {
    "title": "Blade II",
    "poster": "posters/blade_II.webp",
    "date": "2002-03-22",
    "duration": 117,
    "description": "Blade forms an uneasy alliance with the vampire council in order to combat the Reapers, who are feeding on vampires."
  },
  {
    "title": "Spider-Man",
    "poster": "posters/spider-man.webp",
    "date": "2002-05-03",
    "duration": 121,
    "description": "After being bitten by a genetically-modified spider, a shy teenager gains spider-like abilities that he uses to fight injustice as a masked superhero and face a vengeful enemy."
  },
  {
    "title": "Daredevil",
    "poster": "posters/daredevil.webp",
    "date": "2003-02-14",
    "duration": 103,
    "description": "A man blinded by toxic waste which also enhanced his remaining senses fights crime as an acrobatic martial arts superhero."
  },
  {
    "title": "X2",
    "poster": "posters/x2.webp",
    "date": "2003-05-02",
    "duration": 134,
    "description": "When anti-mutant Colonel William Stryker kidnaps Professor X and attacks his school, the X-Men must ally with their archenemy Magneto to stop him."
  },
  {
    "title": "Hulk",
    "poster": "posters/hulk.webp",
    "date": "2003-06-17",
    "duration": 138,
    "description": "Bruce Banner, a genetics researcher with a tragic past, suffers a lab accident that makes him transform into a raging, giant green monster when angered, making him a target of forces seeking to abuse his power."
  },
  {
    "title": "The Punisher",
    "poster": "posters/the_punisher.webp",
    "date": "2004-04-16",
    "duration": 124,
    "description": "An undercover FBI agent becomes a vigilante and sets out to unleash his wrath upon the corrupt businessman who slaughtered his entire family at a reunion."
  },
  {
    "title": "Spider Man 2",
    "poster": "posters/spider-man_2.webp",
    "date": "2004-07-16",
    "duration": 127,
    "description": "Peter Parker is beset with troubles in his failing personal life as he battles a former brilliant scientist named Otto Octavius."
  },
  {
    "title": "Blade: Trinity",
    "poster": "posters/blade_trinity.webp",
    "date": "2004-12-08",
    "duration": 113,
    "description": "Blade, now a wanted man by the FBI, must join forces with the Nightstalkers to face his most challenging enemy yet: Dracula."
  },
  {
    "title": "Elektra",
    "poster": "posters/elektra.webp",
    "date": "2005-01-14",
    "duration": 97,
    "description": "An assassin's change of heart leads her into a war against an evil crime syndicate."
  },
  {
    "title": "Fantastic Four",
    "poster": "posters/fantastic_four.webp",
    "date": "2005-07-08",
    "duration": 106,
    "description": "A group of astronauts gain superpowers after a cosmic radiation exposure and must use them to oppose the plans of their enemy, Doctor Victor Von Doom."
  },
  {
    "title": "X-Men: The Last Stand",
    "poster": "posters/x-men_the_last_stand.webp",
    "date": "2006-05-25",
    "duration": 104,
    "description": "The human government develops a cure for mutations, and Jean Grey becomes a darker uncontrollable persona called the Phoenix who allies with Magneto, causing escalation into an all-out battle for the X-Men."
  },
  {
    "title": "Ghost Rider",
    "poster": "posters/ghost_rider.webp",
    "date": "2007-02-16",
    "duration": 110,
    "description": "A motorcycle stuntman who sold his soul becomes a supernatural agent of vengeance."
  },
  {
    "title": "Spider-Man 3",
    "poster": "posters/spider-man_3.webp",
    "date": "2007-05-04",
    "duration": 139,
    "description": "A strange black entity from another world bonds with Peter Parker and causes inner turmoil as he contends with new villains, temptations, and revenge."
  },
  {
    "title": "Fantastic Four: Rise of the Silver Surfer",
    "poster": "posters/fantastic_four_rise_of_the_silver_surfer.webp",
    "date": "2007-06-15",
    "duration": 92,
    "description": "The Fantastic Four learn that they aren't the only super-powered beings in the universe when they square off against the powerful Silver Surfer and the planet-eating Galactus."
  },
  {
    "title": "Iron Man",
    "poster": "posters/iron_man.webp",
    "date": "2008-05-02",
    "duration": 126,
    "description": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil."
  },
  {
    "title": "The Incredible Hulk",
    "poster": "posters/the_incredible_hulk.webp",
    "date": "2008-06-13",
    "duration": 112,
    "description": "Bruce Banner, a scientist on the run from the U.S. Government, must find a cure for the monster he turns into whenever he loses his temper."
  },
  {
    "title": "Punisher: War Zone",
    "poster": "posters/punisher_war_zone.webp",
    "date": "2008-12-05",
    "duration": 107,
    "description": "Frank Castle, known as the Punisher, ruthlessly demolishes organized crime, but it starts an even bigger war."
  },
  {
    "title": "X-Men Origins: Wolverine",
    "poster": "posters/x-men_origins_wolverine.webp",
    "date": "2009-05-01",
    "duration": 107,
    "description": "The early years of James Logan, featuring his rivalry with his brother Victor Creed, his service in the special forces team Weapon X, and his experimentation into the metal-lined mutant Wolverine."
  },
  {
    "title": "Iron Man 2",
    "poster": "posters/iron_man_2.webp",
    "date": "2010-04-30",
    "duration": 125,
    "description": "With the world now aware of his identity as Iron Man, Tony Stark must contend with both his declining health and a vengeful mad man with ties to his father's legacy."
  },
  {
    "title": "Thor",
    "poster": "posters/thor.webp",
    "date": "2011-05-06",
    "duration": 114,
    "description": "The powerful but arrogant god Thor is cast out of Asgard to live amongst humans in Midgard (Earth), where he soon becomes one of their finest defenders."
  },
  {
    "title": "X-Men: First Class",
    "poster": "posters/x-men_first_class.webp",
    "date": "2011-05-25",
    "duration": 132,
    "description": "In the 1960s, superpowered humans Charles Xavier and Erik Lensherr work together to find others like them, but Erik's vengeful pursuit of an ambitious mutant who ruined his life causes a schism to divide them."
  },
  {
    "title": "Captain America: The First Avenger",
    "poster": "posters/captain_america_the_first_avenger.webp",
    "date": "2011-07-22",
    "duration": 124,
    "description": "Steve Rogers, a rejected military soldier, transforms into Captain America after taking a dose of a \"Super-Soldier serum\". But being Captain America comes at a price as he attempts to take down a warmonger and a terrorist organization."
  },
  {
    "title": "Marvel One-Shot: The Consultant",
    "poster": "posters/the_consultant.webp",
    "date": "2011-09-11",
    "duration": 4,
    "description": "Agents Coulson and Sitwell plan to derail General Thaddeus \"Thunderbolt\" Ross from interfering with S.H.I.E.L.D. affairs with a very special person."
  },
  {
    "title": "Marvel One-Shot: A Funny Thing Happened on the Way to Thor's Hammer",
    "poster": "posters/a_funny_thing_happened_on_the_way_to_thors_hammer.webp",
    "date": "2011-10-25",
    "duration": 4,
    "description": "Agent Coulson stops at a convenience store and deals with a coincidental robbery during his visit."
  },
  {
    "title": "Ghost Rider: Spirit of Vengeance",
    "poster": "posters/ghost_rider_spirit_of_vengeance.webp",
    "date": "2012-02-17",
    "duration": 96,
    "description": "Johnny Blaze, tortured by the Ghost Rider's curse, gets a chance of redemption through protecting the Devil's son, whose father is pursuing him."
  },
  {
    "title": "The Avenpostgers",
    "poster": "posters/the_avengers.webp",
    "date": "2012-05-04",
    "duration": 143,
    "description": "Earth's mightiest heroes must come together and learn to fight as a team if they are going to stop the mischievous Loki and his alien army from enslaving humanity."
  },
  {
    "title": "The Amazing Spider-Man",
    "poster": "posters/the_amazing_spider-man.webp",
    "date": "2012-07-03",
    "duration": 136,
    "description": "After Peter Parker is bitten by a genetically altered spider, he gains newfound, spider-like powers and ventures out to save the city from the machinations of a mysterious reptilian foe."
  },
  {
    "title": "Marvel One-Shot: Item 47",
    "poster": "posters/item_47.webp",
    "date": "2012-09-25",
    "duration": 12,
    "description": "S.H.I.E.L.D. agent Sitwell is assigned to recover an abandoned Chitauri weapon being used by a young couple robbing a bank."
  },
  {
    "title": "Iron Man 3",
    "poster": "posters/iron_man_3.webp",
    "date": "2013-05-03",
    "duration": 130,
    "description": "When Tony Stark's world is torn apart by a formidable terrorist called the Mandarin, he starts an odyssey of rebuilding and retribution."
  },
  {
    "title": "The Wolverine",
    "poster": "posters/the_wolverine.webp",
    "date": "2013-07-26",
    "duration": 126,
    "description": "Wolverine comes to Japan to meet an old friend whose life he saved years ago, and gets embroiled in a conspiracy involving yakuza and mutants."
  },
  {
    "title": "Marvel One-Shot: Agent Carter",
    "poster": "posters/agent_carter.webp",
    "date": "2013-09-23",
    "duration": 15,
    "description": "Frustrated at being marginalized at work, Peggy Carter goes on an unauthorized solo field mission."
  },
  {
    "title": "Agents of S.H.I.E.L.D. Season 1 Episodes 1-7",
    "poster": "posters/agents_of_shield_s1.webp",
    "date": "2013-09-24",
    "duration": 287,
    "description": "The missions of the Strategic Homeland Intervention, Enforcement and Logistics Division."
  },
  {
    "title": "Thor: The Dark World",
    "poster": "posters/thor_the_dark_world.webp",
    "date": "2013-11-08",
    "duration": 112,
    "description": "When the Dark Elves attempt to plunge the universe into darkness, Thor must embark on a perilous and personal journey that will reunite him with doctor Jane Foster."
  },
  {
    "title": "Agents of S.H.I.E.L.D. Season 1 Episodes 8-16",
    "poster": "posters/agents_of_shield_s1.webp",
    "date": "2013-11-20",
    "duration": 366,
    "description": "The team faces new threats—from resurfacing past traumas to powerful enemies like Centipede and the Clairvoyant—while uncovering deeper secrets about Skye, Coulson, and S.H.I.E.L.D. itself."
  },
  {
    "title": "Marvel One-Shot: All Hail The King",
    "poster": "posters/all_hail_the_king.webp",
    "date": "2014-02-04",
    "duration": 14,
    "description": "A documentary filmmaker interviews the now-famous Trevor Slattery from behind bars."
  },
  {
    "title": "Captain America: The Winter Soldier",
    "poster": "posters/captain_america_the_winter_soldier.webp",
    "date": "2014-04-04",
    "duration": 136,
    "description": "As Steve Rogers struggles to embrace his role in the modern world, he teams up with a fellow Avenger and S.H.I.E.L.D agent, Black Widow, to battle a new threat from history: an assassin known as the Winter Soldier."
  },
  {
    "title": "Agents of S.H.I.E.L.D. Season 1 Episodes 17-22",
    "poster": "posters/agents_of_shield_s1.webp",
    "date": "2014-04-09",
    "duration": 247,
    "description": "As the battle intensifies, the team finds themselves hunted and forced into hiding. With S.H.I.E.L.D.'s future in jeopardy, they must confront hidden truths and navigate a world where loyalty is no longer certain."
  },
  {
    "title": "The Amazing Spider-Man 2",
    "poster": "posters/the_amazing_spider-man_2.webp",
    "date": "2014-05-02",
    "duration": 142,
    "description": "When New York is put under siege by Oscorp, it is up to Spider-Man to save the city he swore to protect as well as his loved ones."
  },
  {
    "title": "X-Men: Days of Future Past",
    "poster": "posters/x-men-days-of-future-past.webp",
    "date": "2014-05-23",
    "duration": 151,
    "description": "The X-Men send Wolverine to the past in a desperate effort to change history and prevent an event that results in doom for both humans and mutants."
  },
  {
    "title": "Guardians of the Galaxy",
    "poster": "posters/guardians_of_the_galaxy.webp",
    "date": "2014-08-01",
    "duration": 122,
    "description": "A group of intergalactic criminals must pull together to stop a fanatical warrior with plans to purge the universe."
  },
  {
    "title": "Agents of S.H.I.E.L.D. Season 2 Episodes 1-10",
    "poster": "posters/agents_of_shield_s2.webp",
    "date": "2014-09-23",
    "duration": 411,
    "description": "As Hydra resurfaces with powerful new weapons and hidden agendas, Coulson's team must confront rising threats, personal struggles, and mysterious alien symbols—all while racing to uncover ancient secrets that could change everything."
  },
  {
    "title": "Agent Carter season 1",
    "poster": "posters/agent_carter_s1.webp",
    "date": "2015-01-06",
    "duration": 340,
    "description": "In 1946, Peggy Carter is relegated to secretarial duties in the Strategic Scientific Reserve (SSR). When Howard Stark is accused of treason, he secretly recruits Peggy to clear his name with the help of his butler, Edwin Jarvis."
  },
  {
    "title": "Agents of S.H.I.E.L.D. Season 2 Episodes 11-19",
    "poster": "posters/agents_of_shield_s2.webp",
    "date": "2015-03-04",
    "duration": 368,
    "description": "As the dust settles from Hydra’s war, S.H.I.E.L.D. faces internal fractures, new enemies, and the rise of powerful Inhumans. While Coulson fights to hold the team together, Skye begins to embrace her transformation—and the future of S.H.I.E.L.D. hangs in the balance."
  },
  {
    "title": "Daredevil season 1",
    "poster": "posters/daredevil_s1.webp",
    "date": "2015-04-10",
    "duration": 721,
    "description": "A blind lawyer by day, vigilante by night. Matt Murdock fights the crime of New York as Daredevil."
  },
  {
    "title": "Avengers: Age of Ultron",
    "poster": "posters/avengers_age_of_altron.webp",
    "date": "2015-05-01",
    "duration": 141,
    "description": "When Tony Stark and Bruce Banner try to jump-start a dormant peacekeeping program called Ultron, things go horribly wrong and it's up to Earth's mightiest heroes to stop the villainous Ultron from enacting his terrible plan."
  },
  {
    "title": "Agents of S.H.I.E.L.D. Season 2 Episodes 20-22",
    "poster": "posters/agents_of_shield_s2.webp",
    "date": "2015-05-06",
    "duration": 124,
    "description": "As tensions escalate between S.H.I.E.L.D. and the Inhumans, loyalties are tested and secrets come to light. With war looming, Skye must choose her path as Coulson’s team faces their most personal and world-altering conflict yet."
  },
  {
    "title": "Ant-Man",
    "poster": "posters/ant-man.webp",
    "date": "2015-06-15",
    "duration": 118,
    "description": "Armed with a super-suit with the astonishing ability to shrink in scale but increase in strength, cat burglar Scott Lang must embrace his inner hero and help his mentor, Dr. Hank Pym, pull off a plan that will save the world."
  },
  {
    "title": "Fantastic Four",
    "poster": "posters/fantastic_four_2015.webp",
    "date": "2015-08-06",
    "duration": 100,
    "description": "Four young outsiders teleport to an alternate and dangerous universe which alters their physical form in shocking ways. The four must learn to harness their new abilities and work together to save Earth from a former friend turned enemy."
  },
  {
    "title": "",
    "poster": "posters/.webp",
    "date": "",
    "duration": 0,
    "description": ""
  }
]
